Catalogs/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомОбластиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомОбластиСегментов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Декоративная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбласти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыОбластей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерединаКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВариантыЗубов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокОбластей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбластей()
	
	СписокОбластей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомОбластиСегментов.Ссылка КАК Область,
	|	ВЫБОР
	|		КОГДА стомВариантыЗубовСписокОбластей.Область ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Установлен
	|ИЗ
	|	Справочник.стомОбластиСегментов КАК стомОбластиСегментов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|		ПО (стомВариантыЗубовСписокОбластей.Область = стомОбластиСегментов.Ссылка)
	|			И (стомВариантыЗубовСписокОбластей.Ссылка = &ТекВариант)
	|ГДЕ
	|	НЕ стомОбластиСегментов.ПометкаУдаления
	|	И стомОбластиСегментов.ВидОбласти <> ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ЭлементКонструкции)
	|	И ВЫБОР
	|			КОГДА &ЭтоКонструкция
	|				ТОГДА стомОбластиСегментов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.Конструкция)
	|			ИНАЧЕ стомОбластиСегментов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ОбластьЗуба)
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ТекВариант", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоКонструкция", Объект.Конструкция);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СписокОбластей.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьСписокОбластейОбъекта();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьСписокОбластейОбъекта()
	
	Объект.СписокОбластей.Очистить();
	Для Каждого СтрокаОбласть Из СписокОбластей.НайтиСтроки(Новый Структура("Установлен", Истина)) Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.СписокОбластей.Добавить(), СтрокаОбласть);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкцияПриИзменении(Элемент)
	
	ЗаполнитьСписокОбластей();
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	//видимость элементов
	Элементы.Конструкция.Видимость = Не Объект.Основной;
	Элементы.Основной.Видимость = Не Объект.Конструкция;
	Элементы.Обозначение.Видимость = Не Объект.Конструкция;
	
	Объект.Конструкция = Объект.Конструкция И Не Объект.Основной;
	Объект.Основной = Объект.Основной И Не Объект.Конструкция;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры
